Revit cannot transform the truss Layout Family to the Truss as oriented in the project.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussBadTransformation { get; }
  Visual Basic
Public Shared ReadOnly Property TrussBadTransformation As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussBadTransformation {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures TrussFailures Class
  Autodesk.Revit.DB Namespace